In [2]:
import numpy as np
import pandas as pd
from datetime import datetime

In [3]:
my_year = 2015
my_month = 1
my_day = 1
my_hour = 2
my_minute = 30
my_second = 15

In [4]:
mydate = datetime(my_year,my_month,my_day)

In [5]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [7]:
mydatetime= datetime(my_year,my_month,my_day,my_hour,my_minute,my_second)

In [9]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [10]:
mydatetime.year

2015

In [13]:
mydatetime.month

1

In [42]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [43]:
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [56]:
timeser=pd.to_datetime(myser,format='%d--%b--%Y')

ValueError: time data "Nov 3, 2000" doesn't match format "%d--%b--%Y", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [47]:
obvi_euro_date = '31-12-2000'

In [52]:
pd.to_datetime(obvi_euro_date,dayfirst=True)

Timestamp('2000-12-31 00:00:00')

In [53]:
style_date = '12--Dec--2000'

In [54]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [57]:
strange_date = '12th of Dec 2000'

In [58]:
pd.to_datetime(strange_date)

Timestamp('2000-12-12 00:00:00')

In [60]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [61]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [67]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [68]:
sales['DATE']=pd.to_datetime(sales['DATE'])

In [69]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [74]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [77]:
sales['DATE'][0].month

1

In [79]:
sales['DATE'][0].day

1

In [81]:
sales['DATE'][0].year

1992

In [83]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [84]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [85]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [86]:
sales.iloc[0]['DATE']

Timestamp('1992-01-01 00:00:00')

In [87]:
sales = sales.set_index("DATE")

In [88]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [89]:
sales.resample(rule='A').mean()

C:\Users\FAISAL\AppData\Local\Temp\ipykernel_6692\229365907.py:1: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [91]:
df=pd.read_csv('example.csv')

In [92]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [93]:
df=pd.read_csv('example.csv',header=None)

In [94]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [103]:
df=pd.read_csv('example.csv',index_col=0)

In [104]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [107]:
df.to_csv('new.csv',index=True)

In [108]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15